# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge of `JOIN` statements, using various types of joins and various methods for specifying the links between them.

## Objectives

You will be able to:
* Write SQL queries that make use of various types of joins
* Compare and contrast the various types of joins
* Discuss how primary and foreign keys are used in SQL
* Decide and perform whichever type of join is best for retrieving desired data

## CRM Schema

In almost all cases, rather than just working with a single table you will typically need data from multiple tables. 
Doing this requires the use of **joins** using shared columns from the two tables. 

In this lab, you'll use the same customer relationship management (CRM) database that you saw from the previous lesson.
<img src='images/Database-Schema.png' width="600">

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [1]:
#Your code here
import pandas as pd
import sqlite3
conn = sqlite3.connect('data.sqlite')
cur = conn.cursor()

## Display the names of all the employees in Boston.
Hint: join the employees and offices tables.

In [2]:
#Your code here
cur.execute("""SELECT lastName, firstName
               FROM employees
               JOIN offices
               USING(officeCode)
               WHERE city = 'Boston';""")

df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df.head()

    lastName firstName
0   Firrelli     Julie
1  Patterson     Steve

## Are there any offices that have zero employees?
Hint: Combine the employees and offices tables and use a group by.

In [3]:
#Your code here
cur.execute("""SELECT city, count(*)
               FROM offices
               JOIN employees
               USING(officeCode)
               GROUP BY city
               ;""")

df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df.head()

            city  count(*)
0         Boston         2
1         London         2
2            NYC         2
3          Paris         5
4  San Francisco         6

## Write 3 Questions of your own and answer them

In [ ]:
# Answers will vary
# Example: Display the htmlDescription and employee's first and last name for each product that each employee has sold

In [ ]:
# Your code here

In [ ]:
# Your code here

In [ ]:
# Your code here

## Level Up: Display the names of every individual product that each employee has sold

In [4]:
# Your code here
cur.execute("""SELECT lastName, firstName, productName
               FROM employees as emp
               JOIN customers as cust
               ON emp.employeeNumber = cust.salesRepEmployeeNumber
               JOIN orders
               USING(customerNumber)
               JOIN orderdetails
               USING(orderNumber)
               JOIN products
               USING(productCode)""")
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
print(len(df))
df.head()

2996

   lastName firstName                                  productName
0  Jennings    Leslie                               1958 Setra Bus
1  Jennings    Leslie                       1940 Ford Pickup Truck
2  Jennings    Leslie                      1939 Cadillac Limousine
3  Jennings    Leslie  1996 Peterbilt 379 Stake Bed with Outrigger
4  Jennings    Leslie                            1968 Ford Mustang

## Level Up: Display the Number of Products each employee has sold

In [5]:
# Your code here
cur.execute("""SELECT lastName, firstName, COUNT(productName)
               FROM employees emp
               JOIN customers cust                
               ON emp.employeeNumber = cust.salesRepEmployeeNumber
               JOIN orders 
               USING(customerNumber)
               JOIN orderdetails
               USING(orderNumber)                    
               JOIN products
               USING(productCode)
               GROUP BY lastName
               ORDER BY firstName""")

df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
print(len(df))
df

15

     lastName firstName  COUNT(productName)
0      Fixter      Andy                 185
1       Jones     Barry                 220
2       Tseng  Foon Yue                 142
3      Vanauf    George                 211
4   Hernandez    Gerard                 396
5    Firrelli     Julie                 124
6        Bott     Larry                 236
7    Jennings    Leslie                 331
8    Thompson    Leslie                 114
9      Bondur      Loui                 177
10      Nishi      Mami                 137
11     Gerard    Martin                 114
12   Castillo    Pamela                 272
13      Marsh     Peter                 185
14  Patterson     Steve                 152

## Summary

Congrats! You practiced using join statements and leveraged your foreign keys knowledge!